app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `email` = 'dhara23@gmail.com'
---
    public function register_user(): string
    {
        $users = new Users();
        $dealers = new Dealers();


        $request = $this->request;

        // Get form data
        $firstName = $request->getPost('firstName');
        $lastName = $request->getPost('lastName');
        $email = $request->getPost('email');
        $password = $request->getPost('password');
        $userType = $request->getPost('userType');

        $check_email = $users->where('email',$email)->find();

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`, `user_type`) VALUES ('Chirag', 'Kerkar', 'dhara23@gmail.com', 'Test@123', 'Dealer')
---
            'password' => $password,
            'user_type' => $userType
        ];
        $inserted = $users->insert($data);

INSERT INTO `dealers` (`user_id`, `city`, `state`, `zip_code`) VALUES (8, NULL, NULL, NULL)
---
                'zip_code' => null
            ];

        $dealers->insert($dealerData);

SELECT *
FROM `users`
WHERE `email` = 'dhara23@gmail.com'
AND `password` = 'Test@123'
 LIMIT 1
SELECT *
FROM `dealers`
WHERE `user_id` = '8'
 LIMIT 1
UPDATE `dealers` SET `first_login` = 0
WHERE `user_id` = '8'
---
    public function login_user()
    {
        $users = new Users();
        $dealers = new Dealers();
        $request = $this->request;
        $loginEmail = $request->getPost('loginEmail');
        $loginPassword = $request->getPost('loginPassword');
        $user = $users->where('email', $loginEmail)->where('password', $loginPassword)->first();
        if ($user) {
            $userType = $user['user_type'];
            if ($userType == 'Dealer') {
                $dealer = $dealers->where('user_id', $user['id'])->first();
                if ($dealer['first_login']) {
                    $dealers->set('first_login',0)->where('user_id',$user['id'])->update();

UPDATE `dealers` SET `city` = 'Margao', `state` = 'Goa', `zip_code` = '403602'
WHERE `user_id` = '8'
---
    public function add_dealer_data()
    {
        $users = new Users();
        $dealers = new Dealers();

        $request = $this->request;
        $id = $request->getPost('user_id');
        $city = $request->getPost('City');
        $state = $request->getPost('State');
        $zip_code = $request->getPost('Zip_code');
        $dealers->set([
            'city' => $city,
            'state' => $state,
            'zip_code' => $zip_code
        ])
        ->where('user_id',$id)
        ->update();